zhouxiyu1997/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
uint8_t kReplySpiAddress3D[] = {
    0x0E, 0x8E, 0x00, 0x00, 0x00, 0x00, 0x08, 0x80, 0x00, 0x00, 0x00, 0x00,
    0x90, 0x10, 0x3D, 0x60, 0x00, 0x00, 0x19, 0x00, 0x07, 0x70, 0x00, 0x08,
    0x80, 0x00, 0x07, 0x70, 0x00, 0x08, 0x80, 0x00, 0x07, 0x70, 0x00, 0x07,
    0x70, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xff, 0xff, 0x00, 0x00, 0x00, 0x00};

uint8_t kReplySpiAddress20[] = {
    0x10, 0x8E, 0x00, 0x00, 0x00, 0x00, 0x08, 0x80, 0x00, 0x00, 0x00, 0x00,
    0x90, 0x10, 0x20, 0x60, 0x00, 0x00, 0x18, 0xff, 0xff, 0xff, 0xff, 0xff,
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0x00, 0x00, 0x00, 0x00, 0x00};

uint8_t kReply4001[] = {
    0x15, 0x8E, 0x00, 0x00, 0x00, 0x00, 0x08, 0x80, 0x00, 0x00, 0x00, 0x00,
    0x80, 0x40, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

uint8_t kReply4801[] = {
    0x1A, 0x8E, 0x00, 0x00, 0x00, 0x00, 0x08, 0x80, 0x00, 0x00, 0x00, 0x00,
    0x80, 0x48, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

uint8_t kReply3001[] = {
    0x1C, 0x8E, 0x00, 0x00, 0x00, 0x00, 0x08, 0x80, 0x00, 0x00, 0x00, 0x00,
    0x80, 0x30, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

uint8_t kReply3333[] = {
    0x31, 0x8e, 0x00, 0x00, 0x00, 0x00, 0x08, 0x80, 0x00, 0x08, 0x80, 0x00,
    0xa0, 0x21, 0x01, 0x00, 0x00, 0x00, 0x03, 0x00, 0x05, 0x01, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x7b,
    0x00};

uint8_t kReply3401[] = {
    0x12, 0x8e, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x08, 0x80, 0x00,
    0x80, 0x22, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

esp_bt_cod_t makeDeviceClass() {
  esp_bt_cod_t cod = {};
  cod.minor = 2;
  cod.major = 5;
  cod.service = 1;
  return cod;
}

esp_bt_cod_t kDeviceClass = makeDeviceClass();

}  // namespace

ClassicBtControllerTransport *ClassicBtControllerTransport::instance_ = nullptr;

void ClassicBtControllerTransport::begin() {
  instance_ = this;
  if (inputReportSendMutex_ == nullptr) {
    inputReportSendMutex_ = xSemaphoreCreateRecursiveMutex();
    if (inputReportSendMutex_ == nullptr) {
      Serial.println("WARN bt input-report mutex create failed");
    }
  }
  clearInputs();
  if (!initializeClassicBluetooth()) {
    Serial.println("WARN bt begin failed");
  }
}

bool ClassicBtControllerTransport::initializeNvsAndBaseAddress() {
  esp_err_t err = nvs_flash_init();
  if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
    ESP_ERROR_CHECK(nvs_flash_erase());
    err = nvs_flash_init();
  }

  if (err != ESP_OK) {
    Serial.printf("WARN nvs_init failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  uint8_t baseMac[6] = {};
  const char *baseMacSource = "efuse-derived";
  bool shouldPersistDerivedMac = false;
  nvs_handle handle;
  err = nvs_open("storage", NVS_READWRITE, &handle);
  if (err == ESP_OK) {
    size_t size = sizeof(baseMac);
    err = nvs_get_blob(handle, "mac_addr", baseMac, &size);
    if (err == ESP_OK && size == sizeof(baseMac)) {
      baseMacSource = "nvs";
    } else {
      if (!deriveDeterministicBaseMac(baseMac)) {
        nvs_close(handle);
        return false;
      }
      shouldPersistDerivedMac = true;
    }
  } else {
    Serial.printf(
        "WARN nvs_open failed err=%s; using deterministic base mac fallback\n",
        esp_err_to_name(err));
    if (!deriveDeterministicBaseMac(baseMac)) {
      return false;
    }
  }

  if (shouldPersistDerivedMac) {
    err = nvs_set_blob(handle, "mac_addr", baseMac, sizeof(baseMac));
    if (err != ESP_OK) {
      Serial.printf("WARN nvs_set_blob failed err=%s\n", esp_err_to_name(err));
    } else {
      err = nvs_commit(handle);
      if (err != ESP_OK) {
        Serial.printf("WARN nvs_commit failed err=%s\n", esp_err_to_name(err));
      }
    }
  }

  if (err == ESP_OK || shouldPersistDerivedMac) {
    nvs_close(handle);
  }

  err = esp_base_mac_addr_set(baseMac);
  if (err != ESP_OK) {
    Serial.printf("WARN base_mac_set failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  Serial.printf(
      "INFO bt base_mac=%02X:%02X:%02X:%02X:%02X:%02X source=%s\n",
      baseMac[0],
      baseMac[1],
      baseMac[2],
      baseMac[3],
      baseMac[4],
      baseMac[5],
      baseMacSource);
  return true;
}

bool ClassicBtControllerTransport::initializeClassicBluetooth() {
  initStep_ = "nvs";
  initError_ = "none";
  if (!initializeNvsAndBaseAddress()) {
    return false;
  }

  initStep_ = "btStart";
  if (!btStarted() && !btStart()) {
    initError_ = "btStart_failed";
    Serial.println("WARN btStart failed");
    return false;
  }
  stackStarted_ = true;

  initStep_ = "bluedroid_init";
  esp_err_t err = esp_bluedroid_init();
  if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN bluedroid_init failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  initStep_ = "bluedroid_enable";
  err = esp_bluedroid_enable();
  if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN bluedroid_enable failed err=%s\n", esp_err_to_name(err));
    return false;
  }
  bluedroidReady_ = true;

  // Disable BT modem sleep (RF clock stays on). This tightens sniff LMP
  // timing and reduces the collision window where two simultaneous sniff
  // requests (Switch PM + BTA_DM_PM) leave the ACL TX credit counter stalled.
  esp_bt_sleep_disable();

  initStep_ = "gap_register";
  err = esp_bt_gap_register_callback(
      reinterpret_cast<esp_bt_gap_cb_t>(&ClassicBtControllerTransport::onGapEvent));
  if (err != ESP_OK) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN gap_register failed err=%s\n", esp_err_to_name(err));
    return false;
  }
  gapReady_ = true;

