zhouxiyu1997/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
  if (!paired_ || !authComplete_) {
    return kIdlePrePairingReportIntervalMs;
  }

  return kIdleConnectedReportIntervalMs;
}

void ClassicBtControllerTransport::sendTaskTrampoline(void *param) {
  auto *transport = static_cast<ClassicBtControllerTransport *>(param);
  while (true) {
    // ACL TX stall detection: after the sniff-mode LMP collision (Switch PM
    // vs BTA_DM_PM race), the ESP32 BT controller's num_completed_pkts events
    // stop firing, pinning the L2CAP credit counter at 0. Sends queue (ESP_OK)
    // but SEND_REPORT_EVT comes back reason=8 indefinitely. Detect this by
    // checking how long since the last successful EVT; if > 800 ms while
    // connected+paired, disconnect the HID channel so the Switch reconnects.
    // We do NOT do a full stack restart — just an HID disconnect. The ACL link
    // stays up (or the Switch tears it down), and the Switch reconnects in ~1 s.
    if (transport->paired_ && transport->connected_ &&
        transport->lastSuccessfulSendMs_ > 0 &&
        (millis() - transport->lastSuccessfulSendMs_) > 800) {
      Serial.println("INFO bt acl-stall detected, disconnecting hid");
      // Reset the timer first so this branch doesn't retrigger before
      // paired_/connected_ clear in the upcoming CLOSE_EVT callback.
      transport->lastSuccessfulSendMs_ = 0;
      esp_bt_hid_device_disconnect();
      // Yield so CLOSE_EVT fires and clears paired_/connected_.
      vTaskDelay(pdMS_TO_TICKS(200));
      continue;
    }

    // Deferred reconnect after ACL stall disconnect: the HID stack needs ~500 ms
    // to fully close before a new connect can succeed (avoids busy status:5).
    if (transport->pendingReconnectAfterMs_ > 0 &&
        millis() >= transport->pendingReconnectAfterMs_) {
      transport->pendingReconnectAfterMs_ = 0;
      if (transport->hasPeerAddress_ && !transport->connected_) {
        transport->attemptVirtualCablePlug(transport->lastPeerAddress_, "stall-reconnect");
      }
    }

    // Only send 0x30 reports after pairing handshake completes (paired_ = true).
    // Before that, the interrupt channel must be quiet so the Switch can drive
    // the subcmd sequence (0x02, 0x08, SPI reads, 0x30) without interference.
    // Switch Lite firmware is strict about this: it closes HID if it receives
    // unsolicited 0x30 reports before subcmd 0x03 sets the input report mode.
    // The inputReportSendMutex_ blocks this task during explicit input so it
    // sends immediately when explicit input ends (no stale delay gap).
    if (transport->paired_) {
      transport->sendCurrentInputReport(false);
    }
    vTaskDelay(pdMS_TO_TICKS(transport->idleSendIntervalMs()));
  }
}

bool ClassicBtControllerTransport::pressButtons(
    uint32_t buttonsMask, uint16_t holdMs, uint16_t settleMs) {
  if (!beginExplicitInput()) {
    return false;
  }
  setButtonBits(buttonsMask);
  updateInputReport();
  bool ok = repeatCurrentInputReport(holdMs, true);
  clearInputs();
  if (!repeatCurrentInputReport(settleMs, true)) {
    ok = false;
  }
  endExplicitInput();
  return ok;
}

bool ClassicBtControllerTransport::moveDirection(
    int x, int y, uint16_t holdMs, uint16_t settleMs) {
  if (!beginExplicitInput()) {
    return false;
  }
  buttonsRight_ = 0;
  buttonsShared_ = 0;
  buttonsLeft_ = 0;
  setLeftStickFromVector(x, y);
  updateInputReport();
  bool ok = repeatCurrentInputReport(holdMs, true);
  clearInputs();
  if (!repeatCurrentInputReport(settleMs, true)) {
    ok = false;
  }
  endExplicitInput();
  return ok;
}

bool ClassicBtControllerTransport::resetConnection(bool reconnectLastPeer) {
  const bool shouldReconnectLastPeer = reconnectLastPeer && hasPeerAddress_;
  Serial.printf(
      "INFO bt reset requested mode=stack-restart reconnect_last_peer=%s\n",
      boolName(shouldReconnectLastPeer));

  shutdownClassicBluetooth();

  clearInputs();
  reconnectLastPeerOnRegister_ = shouldReconnectLastPeer;

  if (!initializeClassicBluetooth()) {
    reconnectLastPeerOnRegister_ = false;
    Serial.printf("WARN bt reset restart failed step=%s err=%s\n", initStep_, initError_);
    return false;
  }

  Serial.printf(
      "INFO bt reset completed mode=stack-restart reconnect_last_peer=%s\n",
      boolName(reconnectLastPeerOnRegister_));
  return true;
}

void ClassicBtControllerTransport::enterReconnectableState(const char *reason) {
  connected_ = false;
  readyForReports_ = false;
  authComplete_ = false;
  pairingComplete_ = false;
  paired_ = false;
  discoverable_ = true;
  reportCongested_ = false;
  consecutiveSendReportFailures_ = 0;
  lastSuccessfulSendMs_ = 0; // reset stall timer so it doesn't retrigger
  lastDropReason_ = reason;
  clearInputs();

  esp_err_t err = ESP_OK;
  if (gapReady_ && appRegistered_) {
    err = esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
    discoverable_ = err == ESP_OK;
  }

  Serial.printf(
      "INFO bt reconnectable reason=%s discoverable=%s err=%s\n",
      reason,
      boolName(discoverable_),
      esp_err_to_name(err));
}

void ClassicBtControllerTransport::printStatus(Print &output) const {
  output.println("INFO bt_mode=classic-bt-hid");
  output.println("INFO bt_profile=uartswitchcon-pro-controller");
  output.print("INFO bt_stack_started=");
  output.println(boolName(stackStarted_));
  output.print("INFO bt_bluedroid_ready=");
  output.println(boolName(bluedroidReady_));
  output.print("INFO bt_gap_ready=");
  output.println(boolName(gapReady_));
  output.print("INFO bt_hid_ready=");
  output.println(boolName(hidReady_));
  output.print("INFO bt_app_registered=");
  output.println(boolName(appRegistered_));
  output.print("INFO bt_discoverable=");
  output.println(boolName(discoverable_));
  output.print("INFO bt_connected=");
  output.println(boolName(connected_));
  output.print("INFO bt_auth_complete=");
  output.println(boolName(authComplete_));
  output.print("INFO bt_pairing_complete=");
  output.println(boolName(pairingComplete_));
  output.print("INFO bt_paired=");
  output.println(boolName(paired_));
  output.print("INFO bt_ready_for_reports=");
  output.println(boolName(isControllerInputReady()));
  output.print("INFO bt_init_step=");
  output.println(initStep_);
  output.print("INFO bt_init_error=");
  output.println(initError_);
  output.print("INFO bt_last_drop_reason=");
  output.println(lastDropReason_);
  output.print("INFO bt_ignored_report_count=");
  output.println(ignoredReportCount_);
  output.print("INFO bt_last_ignored_report=");
  output.print(lastIgnoredReportId_);
  output.print("/");
  output.println(lastIgnoredReportLen_);
  output.print("INFO bt_last_acl_disconnect_reason=");
  output.println(lastAclDisconnectReason_);
  output.print("INFO bt_last_hid_close_status=");
  output.println(lastHidCloseStatus_);
  output.print("INFO bt_last_hid_close_conn_status=");
  output.println(lastHidCloseConnStatus_);
  output.print("INFO bt_send_report_failures=");
  output.println(sendReportFailureCount_);
  output.print("INFO bt_last_send_report_status=");
  output.println(lastSendReportStatus_);
  output.print("INFO bt_last_send_report_reason=");
  output.println(lastSendReportReason_);
  output.print("INFO bt_last_send_report_id=");
  output.println(lastSendReportId_);

